# taps
tap 'stripe/stripe-cli'

brew 'openssl@3'

brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'croc'
brew 'gh'
brew 'git'
brew 'jq'
brew 'mysql@8.0', restart_service: true, link: true
brew 'postgresql@16', restart_service: true, link: true
brew 'rbenv'
brew 'stripe/stripe-cli/stripe'
brew 'z'

brew 'thefuck'

brew 'python@3.12'
brew 'go'
cask 'flutter'

cask 'ngrok' # Secure tunnels to localhost

# fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'

# apps
cask '1password'
cask '1password-cli'
cask 'alt-tab'
cask 'bartender'
cask 'chatgpt'
cask 'dropbox'
cask 'ghostty'
cask 'google-chrome'
cask 'iterm2'
cask 'itermai'
cask 'jetbrains-toolbox'
cask 'kdiff3' # quarantined
cask 'keepingyouawake'
cask 'monitorcontrol'
cask 'notion'
cask 'notion-calendar'
cask 'raycast'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'teamviewer'
cask 'virtualbuddy'
cask 'visual-studio-code'

# quicklook
cask 'qlmarkdown'
cask 'qlstephen' # https://github.com/whomwah/qlstephen?tab=readme-ov-file#permissions-quarantine
cask 'quicklook-csv'
cask 'quicklook-json'
