# taps
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

# install zsh
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

brew 'autoconf'
brew 'automake'
brew 'autossh'
brew 'coreutils'
brew 'git'
brew 'git-flow'
brew 'git-standup'
brew 'gnupg'
brew 'graphviz'
brew 'hh'
brew 'highlight'
brew 'htop'
brew 'libtool'
brew 'libyaml'
brew 'node'
brew 'pkg-config'
brew 'readline'
brew 'ssh-copy-id'
brew 'thefuck'
brew 'vagrant-completion'
brew 'vim'
brew 'z'

# services
brew 'elasticsearch', restart_service: true
brew 'memcached', restart_service: true
brew 'mysql', restart_service: true
brew 'postgresql', restart_service: true
brew 'redis', restart_service: true
cask 'java'
cask 'ngrok'

# apps
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'dropbox'
cask 'iterm2'
cask 'launchrocket'
cask 'macvim'
cask 'monodraw'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'teamsql'
cask 'tower'
cask 'vagrant'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'vlc'

# quicklook
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'

# fonts
cask 'font-fira-code'

# mas
mas 'Amphetamine', id: 937984704
mas 'Cleaner for Memory', id: 748212890
mas 'CopyLess', id: 416439303
mas 'DaisyDisk', id: 411643860
mas 'Keynote', id: 409183694
mas 'Magnet', id: 441258766
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Pixelmator', id: 407963104
mas 'Power JSON Editor', id: 499768540
mas 'Skitch', id: 425955336
mas 'SnippetsLab', id: 1006087419
mas 'Spark', id: 1176895641
mas 'Things3', id: 904280696
mas 'WhatsApp', id: 1147396723
mas 'WiFi Explorer', id: 494803304
mas 'Xcode', id: 497799835

